function [] = ishod(h, m_exp, ms_exp, ma_exp, Nma, Nms, Nt, ratioF, maxMa, maxMs, dMa, dMs)
disp('Исходные данные');   
     disp('+------------------------------------------------------+');
     disp(['| Параметр                              | ' 'Значение     |']);
     disp('+------------------------------------------------------+');
     disp([' Толщина среды, мм                        ',num2str(h * 1e3, '%10.2e') ' ']);
     disp([' Коэффициент экстинкции, 1/мм             ',num2str(m_exp / 1e3) ' ']);
     disp([' Коэффициент рассеяния, 1/мм              ',num2str(ms_exp  / 1e3) ' ']);
     disp([' Коэффициент поглощения, 1/мм             ',num2str(ma_exp  / 1e3) ' ']);
     disp([' Количество точек для ms                  ',num2str(Nms,'%-8.2u') ' ']);
     disp([' Количество точек для ma                  ',num2str(Nma,'%-8.2u') ' ']);
     disp([' Количество точек для t                   ',num2str(Nt,'% 8u') ' ']);
     disp([' Отношение Fmax/F(Tmax)                   ',num2str(ratioF) ' ']);
     disp([' Максимальное ma, 1/мм                    ',num2str(maxMa / 1e3) ' ']);
     disp([' Максимальное ms, 1/мм                    ',num2str(maxMs / 1e3) ' ']);
     disp([' Размер ячейки ma x ms, 1/мм x 1/мм       ',num2str(dMa / 1e3) ' x ' ,num2str(dMs / 1e3) ' ']);
     disp('+-----------------------------------------------------+');
 end