function [] = ishod(h, m_exp, ms_exp, ma_exp, Nma, Nms, Nt, ratioF, maxMa, maxMs, dMa, dMs)
disp('Исходные экспериментальные параметры');   
     disp('+----------------------------------------------------------+');
     disp(['| Параметр                                  | ' 'Значение     |']);
     disp('+----------------------------------------------------------+');
     disp([' Толщина среды h, мм                         ',num2str(h * 1e3) ' ']);
     disp([' Коэффициент поглощения ma, 1/мм             ',num2str(ma_exp  / 1e3) ' ']);
     disp([' Коэффициент рассеяния ms, 1/мм              ',num2str(ms_exp  / 1e3) ' ']);
     disp([' Коэффициент экстинкции m, 1/мм              ',num2str(m_exp / 1e3) ' ']);
     disp([' Количество точек для ms Nma                 ',num2str(Nms) ' ']);
     disp([' Количество точек для ma Nms                 ',num2str(Nma) ' ']);
     disp([' Количество точек по времени Nt              ',num2str(Nt) ' ']);
     disp([' Отношение Fmax/F(Tmax)                      ',num2str(ratioF) ' ']);
     disp([' Максимальное ma, 1/мм                       ',num2str(maxMa / 1e3) ' ']);
     disp([' Максимальное ms, 1/мм                       ',num2str(maxMs / 1e3) ' ']);
     disp([' Размер ячейки ma x ms, 1/мм x 1/мм          ',num2str(dMa / 1e3) ' x ' ,num2str(dMs / 1e3) ' ']);
     disp('+----------------------------------------------------------+');
 end