clc
clear all
close all

disp('======================================================================================================');
disp(' ');

disp('*******************************************************************************************************');
disp('* Программа определения параметров рассеивающей среды по экспериментальному временному распределению  *');
disp('*******************************************************************************************************');

%% Первый этап - ввод исходных данных
disp('1 этап. Ввод исходных экспериментальных параметров');
disp('--------------------------------------------------');
[h, m_exp, ms_exp, ma_exp, Nma, Nms, Nt, ratioF, maxMa, maxMs, dMa, dMs, n] = getArgs();

%% Второй этап - Вычисление экспериментального временного распределения импульса излучения

%Подэтап - Параметры экспериментального распределения T_Fmax, Fmax, Tmax, F(Tmax)
[Tmax] = getTmax(h, m_exp, ms_exp, ratioF, Nt, n);

disp('2 этап. Вычисление экспериментального временного распределения импульса излучения');
disp('---------------------------------------------------------------------------------');
[t, F, t0, F0, indleft, indright, dt] = calc(0, h, m_exp, ms_exp, Tmax, Nt, n);
disp(['Полная энергия временного распределения = ' num2str(sum(F)*dt) ' Дж']);

figure()
plot(t * 1e12, F, 'r', [t(indleft)*1e12, t0*1e12, t(indright)*1e12], [F(indleft), F0, F(indright)], 'k');
title({ 'Экспериментальное временное распределение импульса излучения' ; 'после прохождения однородного рассеивающего слоя,'; ['dt = ', num2str(dt * 1e12), ' пс']});
xlabel('Время, пс');
ylabel('Интенсивность излучения, Вт');
grid on;

%% Третий этап - Поиск параметров среды, соответствующих экспериментальному временному распределению

disp('Поиск параметров среды, соответствующих экспериментальному временному распределению');

[ma_teor, ms_teor] = calcMaMs(F, ma_exp, ms_exp, h, Tmax, Nt, maxMa, maxMs, dMa, dMs, n);

m_teor = ma_teor + ms_teor;

[t, F_exp, t0, F0, indleft, indright] = calc(0, h, m_teor, ms_teor, Tmax, Nt, n); 

figure()
plot(t * 1e12, F_exp, 'r', t * 1e12, F, 'b', [t(indleft)*1e12, t0*1e12, t(indright)*1e12], [F(indleft), F0, F(indright)], 'k');
title({'Сравнение полученного теоретического временного' ; ' распределения импульса излучения с экспериментальным'});
legend('Экспериментальное распределение','Теоретическое распределение')
xlabel('Время, пс');
ylabel('Интенсивность излучения, Вт');
grid on;
%% Конец программы
disp('*******************************************************************************************************');
disp('*                                    Конец работы программы                                           *');
disp('*******************************************************************************************************');
