clc
clear all
close all

disp('======================================================================================================');
disp(' ');

disp('*******************************************************************************************************');
disp('* Программа определения параметров рассеивающей среды по экспериментальному временному распределению  *');
disp('*******************************************************************************************************');

%% Первый этап - ввод исходных данных
disp('1 этап. Ввод исходных экспериментальных параметров');
disp('--------------------------------------------------');
[h, m_exp, ms_exp, ma_exp, Nma, Nms, Nt, ratioF, maxMa, maxMs, dMa, dMs, n] = getArgs();

%% Второй этап - Вычисление экспериментального временного распределения импульса излучения

%Подэтап - Параметры экспериментального распределения T_Fmax, Fmax, Tmax, F(Tmax)
[Tmax] = getTmax(h, m_exp, ms_exp, ratioF, Nt, n);

disp('2 этап. Вычисление экспериментального временного распределения импульса излучения');
disp('---------------------------------------------------------------------------------');
[t, F, t0, F0, dt] = calc(0, h, m_exp, ms_exp, Tmax, Nt, n);
disp(['Полная энергия временного распределения = ' num2str(sum(F)*dt) ' Дж']);

F0_min_log = max(F) * 10;
F0_min = max(F) * 1.3;

figure()
subplot(2, 1, 1)
if (F0 / max(F) > 1)
    F0_text = sprintf('Баллистический компонент F0: %.2e Вт', F0);
    semilogy([t0*1e12, t0*1e12], [1, F0_min_log], 'k');
    legend(F0_text)
    axis([0 max(t * 1e12) 0 max(F0_min_log * 10)])
else
    semilogy([t0*1e12, t0*1e12], [1, F0], 'k');
    axis([0 max(t * 1e12) 0 max(F * 10)])
end
hold on;
grid on;
semilogy(t * 1e12, F, 'r');
title({ 'Экспериментальное временное распределение импульса излучения' ; 'после прохождения однородного рассеивающего слоя,'; ['дискретизация по времени ', num2str(dt * 1e12), ' пс, t_0 =', num2str(t0 * 1e12), ' пс']});
xlabel('Время, пс');
ylabel('Интенсивность излучения, Вт');

subplot(2, 1, 2)
if (F0 / max(F) > 1)
    F0_text = sprintf('Баллистический компонент F0: %.2e Вт', F0);
    plot([t0*1e12, t0*1e12], [0, F0_min], 'k');
    legend(F0_text)
    axis([0 max(t * 1e12) 0 max(F0_min + (F0_min * 0.1))])
else
    semilogy([t0*1e12, t0*1e12], [0, F0], 'k');
    axis([0 max(t * 1e12) 0 max(F + (F * 0.1))])
end
hold on;
grid on;
plot(t * 1e12, F, 'r');
title({ 'Экспериментальное временное распределение импульса излучения' ; 'после прохождения однородного рассеивающего слоя,'; ['дискретизация по времени ', num2str(dt * 1e12), ' пс, t_0 =', num2str(t0 * 1e12), ' пс']});
xlabel('Время, пс');
ylabel('Интенсивность излучения, Вт');
disp(' ');

%% Третий этап - Поиск параметров среды, соответствующих экспериментальному временному распределению

disp('3 этап. Поиск параметров среды, соответствующих экспериментальному временному распределению');
disp('-------------------------------------------------------------------------------------------');
[ma_teor, ms_teor] = calcMaMs(F, ma_exp, ms_exp, h, Tmax, Nt, maxMa, maxMs, dMa, dMs, n);

m_teor = ma_teor + ms_teor;

[t, F_exp, t0, F0] = calc(0, h, m_teor, ms_teor, Tmax, Nt, n); 

figure()
subplot(2, 1, 1)
semilogy(t * 1e12, F_exp, 'r', t * 1e12, F, 'b');
hold on;
grid on;
if (F0 / max(F) > 1)
    F0_text = sprintf('Баллистический компонент F0: %.2e Вт', F0);
    semilogy([t0*1e12, t0*1e12], [1, F0_min_log], 'k');
    legend('Экспериментальное распределение','Теоретическое распределение', F0_text)
    axis([0 max(t * 1e12) 0 max(F0_min_log * 10)])
else
    semilogy([t0*1e12, t0*1e12], [1, F0], 'k');
    axis([0 max(t * 1e12) 0 max(F * 10)])
    legend('Экспериментальное распределение','Теоретическое распределение', 'Баллистический компонент')
end
title({'Полученное теоретическое и экспериментальное временные' ; ' распределения импульса излучения'; ['t_0 = ', num2str(t0 * 1e12), ' пс']});
xlabel('Время, пс');
ylabel('Интенсивность излучения, Вт');

subplot(2, 1, 2)
plot(t * 1e12, F_exp, 'r', t * 1e12, F, 'b');
hold on;
grid on;
if (F0 / max(F) > 1)
    F0_text = sprintf('Баллистический компонент F0: %.2e Вт', F0);
    plot([t0*1e12, t0*1e12], [0, F0_min], 'k');
    legend('Экспериментальное распределение','Теоретическое распределение', F0_text)
    axis([0 max(t * 1e12) 0 max(F0_min + (F0_min * 0.1))])
else
    plot([t0*1e12, t0*1e12], [0, F0], 'k');
    axis([0 max(t * 1e12) 0 max(F + (F * 0.1))])
    legend('Экспериментальное распределение','Теоретическое распределение', 'Баллистический компонент')
end
title({'Полученное теоретическое и экспериментальное временные' ; ' распределения импульса излучения'; ['t_0 = ', num2str(t0 * 1e12), ' пс']});
xlabel('Время, пс');
ylabel('Интенсивность излучения, Вт');
%% Конец программы
disp('*******************************************************************************************************');
disp('*                                        Конец работы                                                 *');
disp('*******************************************************************************************************');
