function [] = vivod(ma_exp, ms_exp, ma_teor, ms_teor, delta_ma, delta_ms, dMa, dMs)

disp(' ');
disp('Найденные параметры рассеивающей среды');
    disp('+-------------------------------------------------------------------+');
    disp(['| Параметр    '     '      | Заданное ' '| Полученное ' '| Отклонение ' '| Точность |'])
    disp(['|             '     '      | значение ' '|  значение  ' '|            ' '|          |'])
    disp('+-------------------------------------------------------------------+');
    disp(' Коэффициент');
    disp([' поглощения, 1/мм      '  num2str(ma_exp / 1e3) '          '  num2str(ma_teor / 1e3) '          '  num2str(delta_ma / 1e3) '         '   num2str(dMa / 1e3) '    ']);
    disp(' Коэффициент');
    disp([' рассеяния, 1/мм       '  num2str(ms_exp / 1e3) '          '  num2str(ms_teor / 1e3) '          '  num2str(delta_ms / 1e3) '         '   num2str(dMs / 1e3) '    ']);
    disp('+-------------------------------------------------------------------+');
disp(' ');

end