function [] = vivod(ma_exp, ms_exp, ma_teor, ms_teor, delta_ma, delta_ms, dMa, dMs)

disp(' ');
disp('Найденные параметры рассеивающей среды');
    disp('+----------------------------------------------------------------------------+');
    disp(['|          '     '    | Заданное ' '| Полученное ' '| Отклонение ' '|    Размер   |' ' Точность |'])
    disp(['| Параметр '     '    | значение ' '|  значение  ' '|    1/мм    ' '|    ячейки   |' '     %    |'])
    disp(['|          '     '    |   1/мм   ' '|    1/мм    ' '|            ' '| 1/мм x 1/мм |' '          |'])
    disp('+----------------------------------------------------------------------------+');
    disp(' Коэффициент');
    disp([' поглощения         '  num2str(ma_exp / 1e3) '          '  num2str(ma_teor / 1e3) '          '  num2str(delta_ma / 1e3) '         '   num2str(dMa / 1e3) '         ' num2str(delta_ma / ma_teor * 100, 3)]);
    disp(' Коэффициент');
    disp([' рассеяния          '  num2str(ms_exp / 1e3) '          '  num2str(ms_teor / 1e3) '          '  num2str(delta_ms / 1e3) '         '   num2str(dMs / 1e3) '         ' num2str(delta_ms / ms_teor * 100, 3)]);
    disp('+----------------------------------------------------------------------------+');
disp(' ');

end